Samsung/TizenRT/os/board/bk7239n/src/middleware/soc/bk7239n/soc/sys_struct.h
/*reg0x21*/
typedef volatile union {
	struct {
		uint32_t cpu0_mac_int_port_trigger_int_en :  1; /**<bit[0 : 0] */
		uint32_t cpu0_mac_int_tx_trigger_int_en   :  1; /**<bit[1 : 1] */
		uint32_t cpu0_mac_int_rx_trigger_int_en   :  1; /**<bit[2 : 2] */
		uint32_t cpu0_mac_int_tx_rx_misc_int_en   :  1; /**<bit[3 : 3] */
		uint32_t cpu0_mac_int_tx_rx_timer_int_en  :  1; /**<bit[4 : 4] */
		uint32_t cpu0_phy_riu_int_int_en          :  1; /**<bit[5 : 5] */
		uint32_t cpu0_phy_mbp_int_int_en          :  1; /**<bit[6 : 6] */
		uint32_t cpu0_bt_irq_int_en               :  1; /**<bit[7 : 7] */
		uint32_t cpu0_ble_irq_int_en              :  1; /**<bit[8 : 8] */
		uint32_t cpu0_dm_irq_int_en               :  1; /**<bit[9 : 9] */
		uint32_t cpu0_qspi0_int_en                :  1; /**<bit[10 : 10] */
		uint32_t cpu0_resv8_int_en                :  1; /**<bit[11 : 11] */
		uint32_t cpu0_resv9_int_en                :  1; /**<bit[12 : 12] */
		uint32_t cpu0_resv10_int_en               :  1; /**<bit[13 : 13] */
		uint32_t cpu0_resv11_int_en               :  1; /**<bit[14 : 14] */
		uint32_t cpu0_resv12_int_en               :  1; /**<bit[15 : 15] */
		uint32_t cpu0_thread_int_en               :  1; /**<bit[16 : 16] */
		uint32_t cpu0_resv13_int_en               :  1; /**<bit[17 : 17] */
		uint32_t cpu0_otp_int_en                  :  1; /**<bit[18 : 18] */
		uint32_t cpu0_dpllunlock_int_en           :  1; /**<bit[19 : 19] */
		uint32_t cpu0_resv14_int_en               :  1; /**<bit[20 : 20] */
		uint32_t cpu0_resv15_int_en               :  1; /**<bit[21 : 21] */
		uint32_t cpu0_resv16_int_en               :  1; /**<bit[22 : 22] */
		uint32_t cpu0_gpio_s_int_en               :  1; /**<bit[23 : 23] */
		uint32_t cpu0_gpio_ns_int_en              :  1; /**<bit[24 : 24] */
		uint32_t cpu0_resv17_int_en               :  1; /**<bit[25 : 25] */
		uint32_t cpu0_ana_gpio_int_en             :  1; /**<bit[26 : 26] */
		uint32_t cpu0_ana_rtc_int_en              :  1; /**<bit[27 : 27] */
		uint32_t cpu0_abnormal_gpio_int_en        :  1; /**<bit[28 : 28] */
		uint32_t cpu0_abnormal_rtc_int_en         :  1; /**<bit[29 : 29] */
		uint32_t cpu0_resv18_int_en               :  1; /**<bit[30 : 30] */
		uint32_t cpu0_resv19_int_en               :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} system_cpu0_int_32_63_en_t;

/*reg0x28*/
typedef volatile union {
	struct {
		uint32_t cpu0_dma_nsec_intr_st            :  1; /**<bit[0 : 0] */
		uint32_t cpu0_stcp_sec_intr_st            :  1; /**<bit[1 : 1] */
		uint32_t cpu0_stcp_nsec_intr_st           :  1; /**<bit[2 : 2] */
		uint32_t cpu0_timer_int_st                :  1; /**<bit[3 : 3] */
		uint32_t cpu0_uart0_int_st                :  1; /**<bit[4 : 4] */
		uint32_t cpu0_pwm0_int_st                 :  1; /**<bit[5 : 5] */
		uint32_t cpu0_i2c0_int_st                 :  1; /**<bit[6 : 6] */
		uint32_t cpu0_spi0_int_st                 :  1; /**<bit[7 : 7] */
		uint32_t cpu0_sadc_int_st                 :  1; /**<bit[8 : 8] */
		uint32_t cpu0_uart3_int_st                :  1; /**<bit[9 : 9] */
		uint32_t cpu0_sdio_int_st                 :  1; /**<bit[10 : 10] */
		uint32_t cpu0_gdma_int_st                 :  1; /**<bit[11 : 11] */
		uint32_t cpu0_la_int_st                   :  1; /**<bit[12 : 12] */
		uint32_t cpu0_timer1_int_st               :  1; /**<bit[13 : 13] */
		uint32_t cpu0_i2c1_int_st                 :  1; /**<bit[14 : 14] */
		uint32_t cpu0_uart1_int_st                :  1; /**<bit[15 : 15] */
		uint32_t cpu0_uart2_int_st                :  1; /**<bit[16 : 16] */
		uint32_t cpu0_spi1_int_st                 :  1; /**<bit[17 : 17] */
		uint32_t cpu0_led_int_st                  :  1; /**<bit[18 : 18] */
		uint32_t cpu0_resv0_int_st                :  1; /**<bit[19 : 19] */
		uint32_t cpu0_resv1_int_st                :  1; /**<bit[20 : 20] */
		uint32_t cpu0_ckmn_int_st                 :  1; /**<bit[21 : 21] */
		uint32_t cpu0_resv2_int_st                :  1; /**<bit[22 : 22] */
		uint32_t cpu0_resv3_int_st                :  1; /**<bit[23 : 23] */
		uint32_t cpu0_i2s0_int_st                 :  1; /**<bit[24 : 24] */
		uint32_t cpu0_resv4_int_st                :  1; /**<bit[25 : 25] */
		uint32_t cpu0_resv5_int_st                :  1; /**<bit[26 : 26] */
		uint32_t cpu0_resv6_int_st                :  1; /**<bit[27 : 27] */
		uint32_t cpu0_resv7_int_st                :  1; /**<bit[28 : 28] */
		uint32_t cpu0_int_mac_wakeup_int_st       :  1; /**<bit[29 : 29] */
		uint32_t cpu0_hsu_irq_int_st              :  1; /**<bit[30 : 30] */
		uint32_t cpu0_mac_int_gst_int_st          :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} system_cpu0_int_0_31_status_t;

/*reg0x29*/
typedef volatile union {
	struct {
		uint32_t cpu0_mac_int_port_trigger_int_st :  1; /**<bit[0 : 0] */
		uint32_t cpu0_mac_int_tx_trigger_int_st   :  1; /**<bit[1 : 1] */
		uint32_t cpu0_mac_int_rx_trigger_int_st   :  1; /**<bit[2 : 2] */
		uint32_t cpu0_mac_int_tx_rx_misc_int_st   :  1; /**<bit[3 : 3] */
		uint32_t cpu0_mac_int_tx_rx_timer_int_st  :  1; /**<bit[4 : 4] */
		uint32_t cpu0_phy_riu_int_int_st          :  1; /**<bit[5 : 5] */
		uint32_t cpu0_phy_mbp_int_int_st          :  1; /**<bit[6 : 6] */
		uint32_t cpu0_bt_irq_int_st               :  1; /**<bit[7 : 7] */
		uint32_t cpu0_ble_irq_int_st              :  1; /**<bit[8 : 8] */
		uint32_t cpu0_dm_irq_int_st               :  1; /**<bit[9 : 9] */
		uint32_t cpu0_qspi0_int_st                :  1; /**<bit[10 : 10] */
		uint32_t cpu0_resv8_int_st                :  1; /**<bit[11 : 11] */
		uint32_t cpu0_resv9_int_st                :  1; /**<bit[12 : 12] */
		uint32_t cpu0_resv10_int_st               :  1; /**<bit[13 : 13] */
		uint32_t cpu0_resv11_int_st               :  1; /**<bit[14 : 14] */
		uint32_t cpu0_resv12_int_st               :  1; /**<bit[15 : 15] */
		uint32_t cpu0_thread_int_st               :  1; /**<bit[16 : 16] */
		uint32_t cpu0_resv13_int_st               :  1; /**<bit[17 : 17] */
		uint32_t cpu0_otp_int_st                  :  1; /**<bit[18 : 18] */
		uint32_t cpu0_dpllunlock_int_st           :  1; /**<bit[19 : 19] */
		uint32_t cpu0_resv14_int_st               :  1; /**<bit[20 : 20] */
		uint32_t cpu0_resv15_int_st               :  1; /**<bit[21 : 21] */
		uint32_t cpu0_resv16_int_st               :  1; /**<bit[22 : 22] */
		uint32_t cpu0_gpio_s_int_st               :  1; /**<bit[23 : 23] */
		uint32_t cpu0_gpio_ns_int_st              :  1; /**<bit[24 : 24] */
		uint32_t cpu0_resv17_int_st               :  1; /**<bit[25 : 25] */
		uint32_t cpu0_ana_gpio_int_st             :  1; /**<bit[26 : 26] */
		uint32_t cpu0_ana_rtc_int_st              :  1; /**<bit[27 : 27] */
		uint32_t cpu0_abnormal_gpio_int_st        :  1; /**<bit[28 : 28] */
		uint32_t cpu0_abnormal_rtc_int_st         :  1; /**<bit[29 : 29] */
		uint32_t cpu0_resv18_int_st               :  1; /**<bit[30 : 30] */
		uint32_t cpu0_resv19_int_st               :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} system_cpu0_int_32_63_status_t;

/*reg0x30*/
typedef volatile union {
	struct {
		uint32_t gpio_config0                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} system_gpio_config0_t;

/*reg0x31*/
typedef volatile union {
	struct {
		uint32_t gpio_config1                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} system_gpio_config1_t;

