Samsung/TizenRT/os/board/bk7239n/src/middleware/soc/bk7239n/soc/sys_struct.h
/*reg0x32*/
typedef volatile union {
	struct {
		uint32_t gpio_config2                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} system_gpio_config2_t;

/*reg0x38*/
typedef volatile union {
	struct {
		uint32_t dbug_msg                         : 16; /**<bit[0 : 15] */
		uint32_t dbug_mux                         :  4; /**<bit[16 : 19] */
		uint32_t reserved_20_31                   : 12; /**<bit[20 : 31] */
	};
	uint32_t v;
} system_dbug_config0_t;

/*reg0x3a*/
typedef volatile union {
	struct {
		uint32_t anareg_stat                      : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} system_anareg_stat_t;

typedef volatile struct {
	volatile system_device_id_t device_id;
	volatile system_version_id_t version_id;
	volatile system_cpu_storage_connect_op_select_t cpu_storage_connect_op_select;
	volatile system_cpu_current_run_status_t cpu_current_run_status;
	volatile system_cpu0_int_halt_clk_op_t cpu0_int_halt_clk_op;
	volatile uint32_t rsv_5_7[3];
	volatile system_cpu_clk_div_mode1_t cpu_clk_div_mode1;
	volatile system_cpu_clk_div_mode2_t cpu_clk_div_mode2;
	volatile system_cpu_26m_wdt_clk_div_t cpu_26m_wdt_clk_div;
	volatile system_cpu_anaspi_freq_t cpu_anaspi_freq;
	volatile system_cpu_device_clk_enable_t cpu_device_clk_enable;
	volatile uint32_t rsv_d_e[2];
	volatile system_cpu_device_mem_ctrl2_t cpu_device_mem_ctrl2;
	volatile system_cpu_power_sleep_wakeup_t cpu_power_sleep_wakeup;
	volatile system_cpu0_lv_sleep_cfg_t cpu0_lv_sleep_cfg;
	volatile system_cpu_device_mem_ctrl3_t cpu_device_mem_ctrl3;
	volatile uint32_t rsv_13_1f[13];
	volatile system_cpu0_int_0_31_en_t cpu0_int_0_31_en;
	volatile system_cpu0_int_32_63_en_t cpu0_int_32_63_en;
	volatile uint32_t rsv_22_27[6];
	volatile system_cpu0_int_0_31_status_t cpu0_int_0_31_status;
	volatile system_cpu0_int_32_63_status_t cpu0_int_32_63_status;
	volatile uint32_t rsv_2a_2f[6];
	volatile system_gpio_config0_t gpio_config0;
	volatile system_gpio_config1_t gpio_config1;
	volatile system_gpio_config2_t gpio_config2;
	volatile uint32_t rsv_33_37[5];
	volatile system_dbug_config0_t dbug_config0;
	volatile uint32_t rsv_39_39[1];
	volatile system_anareg_stat_t anareg_stat;
} sys_hw_t;

#ifdef __cplusplus
}
#endif
